[
  {
    "id": "empire",
    "title": "How To Build A Digital Media Empire",
    "date": "2025-07-05",
    "excerpt": "Honestly, it's hard to describe.",
    "image": "/assets/blog-photos/media.png",
    "url": "/newsletter/post.html?id=empire",
    "setting": "\n\nHonestly, it's hard to describe.\n\n\n\nIt feels like nothing you try seems to work.\n\nEveryone says be consistent — and you're being consistent — but it's hard to keep going when you aren't seeing results.\n\n\n\n",
    "antagonist": "\n\nSometimes I wake up and I don't want to get out of bed.\n\nI don't want to work.\n\nSometimes I don't work.\n\nAnd when I don’t, I feel bad.\n\nIt feels like I wasted the day.\n\n\n\nI think about all the professional athletes I looked up to as a kid.\n\n\n\nIs it true they never missed a day of work?\n\n\n\nHow do people show up every single day of their life?\n\n\n\nMaybe they've figured out their direction.\n\nMe? I struggle to wake up and work — even on things I care about.\n\n\n\nPeople look at me and see someone who works hard.\n\nBut the truth is, I struggle to work hard.\n\nI see others succeeding, and I get envious.\n\nI get jealous.\n\n\n\n",
    "protagonist": "\n\nThe Protagonist is cold.\n\nUnshaken.\n\nUnmovable.\n\n\n\nDeep down, he knows the direction he needs to go in.\n\nEven when his mind pulls him off track, he fights back.\n\n\n\nHe doesn’t always know exactly what to do.\n\nHe doesn’t always know where he’s going.\n\nBut he trusts his purpose.\n\nAnd most importantly — he trusts himself.\n\n\n\n",
    "conclusion": "\n\nHere’s how to set yourself up for success every single week:\n\n\n\n1. **Start the week off with a brain dump**\n\nWrite down everything inside your head. Every idea. Every fear. Every passing thought.\n\nDon’t worry about filtering or organizing. Just empty your mental RAM so you can *see* what you’re working with.\n\n\n\n2. **Feed the brain dump into ChatGPT**\n\nLet AI help you make sense of it. You’re building a new world, a new game, a new quest log for yourself.\n\nLeverage the power of ChatGPT to help you extract clarity.\n\n\n\n3. **Use the output to create a rough draft**\n\nThis is your prototype. Don’t judge it. Let it be messy. Let it reflect your raw thinking.\n\nUse any structure that works for you — even mine.\n\n\n\n4. **Refine the draft with ChatGPT or your own voice**\n\nUse ChatGPT to tighten grammar, improve flow, or expand on ideas.\n\nAdd your voice back in. Mix structure with soul.\n\n\n\n5. **Create your Final Draft**\n\nMake last edits. Read it out loud. Feed it to ChatGPT one final time for a polish.\n\nThen trust what you wrote — and hit publish.\n\n\n\n6. **Use that final output everywhere**\n\n- Post it as your newsletter\n\n- Turn it into a YouTube script\n\n- Clip it into X/Twitter threads\n\n- Grab a photo, and use ChatGPT to write a caption\n\n- Use the caption as-is or edit it into your voice\n\n\n\nThis is the process I repeat every week.\n\nAnd when I fall off — I pick it back up and keep going.\n\n\n\nYou’re building a database of truth. A record of your battles, your thinking, your wins and losses.\n\nThat database becomes your media engine.\n\n\n\nAnd that engine becomes your digital empire.\n\n\n\nIt starts now.\n\n\n\nLove,\n\n\n\n**Matthew McMahon**\n\n"
  },
  {
    "id": "money",
    "title": "How To Make Money Online",
    "date": "2025-07-19",
    "excerpt": "So you started your own business... how do you actually make money?",
    "image": "/assets/blog-photos/money.png",
    "url": "/newsletter/post.html?id=money",
    "setting": "\n\nSo you started your own business…\n\n\n\nHow do you actually make money?\n\n\n\nI’m 26 years old, and I’m trying to figure that out too.\n\n\n\nI’ve got a website.\n\nA newsletter.\n\nA YouTube channel.\n\n\n\nI’m showing up consistently on all three — and still, I don’t know how to actually *make* money online.\n\n\n\nIn the last 7 years of trying, I’ve probably made $50 total:\n\n- A couple of Shopify t-shirt sales\n\n- A few pennies from TikTok livestreams\n\n\n\nThat’s it.\n\n\n\nBut I’ve never been this consistent before.\n\n\n\nSo what’s the bug?\n\n\n\nWhy isn’t this clicking?\n\n\n\nI’ve been dead broke trying to build something online.\n\nAnd I know I’m not alone.\n\n\n\nThat’s why I’m writing this.\n\nNot because I have the answers — but because I’m documenting the process of finding them.\n\n\n\nIf you're feeling stuck — like you're doing all the \"right\" things and still not making money — you're not alone.\n\n\n\n",
    "antagonist": "\n\nThe Antagonist doesn’t believe it’s possible to make money online.\n\n\n\nHe says:\n\n- “You have to work for someone else.”\n\n- “Making money on YouTube is for clout-chasers.”\n\n- “Those people just got lucky.”\n\n\n\nHe sees building something online as foolish.\n\n\n\nHe thinks the internet is for *watching*, not *creating*.\n\n\n\nHe’s the opposite of a builder.\n\nHe’s the consummate consumer.\n\n\n\n",
    "protagonist": "\n\nThe Protagonist knows that’s not true.\n\n\n\nHe believes making money online *is* possible.\n\nNot because he’s better than anyone — but because he knows no one’s better than him.\n\n\n\nHe’s seen others do it.\n\nHe believes he can too — if he shows up, builds skills, and serves others, virtually.\n\n\n\nHe believes that if he stays consistent — posts once or twice a week on YouTube, keeps writing, keeps improving — eventually someone will want to buy what he’s built.\n\n\n\nHe believes in showing up, even when the numbers are quiet.\n\n\n\nThe Protagonist works indefinitely, infinitely, in the right direction.\n\nAnd because he keeps moving infinitely in that direction, he outpaces those who move faster — because they eventually burn out. He doesn’t.\n\n\n\nThe Protagonist *has* worked in big companies.\n\nAnd he knows that trying too hard makes people feel insecure.\n\nWork less. Blend in. Don’t make waves — that’s the unspoken rule.\n\n\n\nBut he’s not built like that.\n\nSo he left.\n\nMultiple times.\n\n\n\n",
    "conclusion": "\n\nHere’s what I *do* know about making money online:\n\n\n\nIt comes down to two things:\n\n\n\n1. **Marketing**\n\nMarketing is just showing off what you’ve already done.\n\nIt’s documentation at its finest.\n\n\n\nWrite about what you're doing.\n\nTalk about what you're building.\n\n\n\nThis builds brand awareness, trust, and a reputation.\n\nForce yourself to get on camera at least once a week — and be honest.\n\n\n\n2. **Product**\n\nThis one’s still a struggle for me.\n\n\n\nBut before the product, comes the skills.\n\nI’ve gotten really good at getting in shape.\n\nI’m decent at building websites.\n\nI’m decent at making films and marketing myself.\n\n\n\nAny one of those could become a product in due time.\n\n\n\n---\n\n\n\nSome people succeed with a brilliant product and no marketing.\n\nOthers succeed with world-class marketing and a mid product (👋 Prime).\n\n\n\nEither way — you need a reason for someone to **pay attention**,\n\nor a reason for someone to **pay**.\n\nOr — ideally — both.\n\n\n\nThat’s the game I’m learning to play.\n\nI encourage you to join.\n\n\n\nIn the meantime, I’ll keep sharing what I learn.\n\n\n\nUntil then — I appreciate you reading.\n\n\n\nPeace\n\n\n\nLove,\n\n\n\n**Matthew McMahon**\n\n"
  },
  {
    "id": "build",
    "title": "Build Your Own Business",
    "date": "2025-07-12",
    "excerpt": "It feels like everyone online has their own business.",
    "image": "/assets/blog-photos/build.png",
    "url": "/newsletter/post.html?id=build",
    "setting": "It feels like everyone online has their own business.\n\n\n\nAnd in some way, shape, or form, it seems like they’re all trying to sell you something big.\n\n\n\nMaybe they’re promoting themselves on social media.\n\n\n\nEvery week, it seems like there is a:\n\n\n\n- Newsletter landing directly in an inbox\n\n- YouTube video pinned to the top of the feed (with subsequent shorts)\n\n- String of Tweets on X (are they still called tweets?)\n\n- Combination of Reels and photo dumps on Instagram\n\n- LinkedIn post for the career crowd\n\n\n\nHow is that possible?\n\n\n\nWhat kind of media engine is being run?\n\n\n\nIs it all just AI behind the scenes?\n\n\n\nIt’s almost like a single person is running an entire digital media company—from the comfort of their home office.\n\n\n\nAnd you're wondering:\n\nHow am I supposed to do that?\n\n\n\nRemember Luke Skywalker at the beginning of A New Hope?\n\n\n\nHe’s stuck on Tatooine.\n\nThis force-capable, potential jedi... with no purpose.\n\n\n\nHe’s alone.\n\n\n\nWaiting.\n\n\n\nWatching.\n\n\n\nThat could be You right now.\n\n\n\nEveryone around says college is the best path to learn a new skill.\n\n\n\nMaybe it’s the family business offering a job to learn while getting paid.\n\n\n\nOr it's a fair job offer, with a solid 401(k).\n\n\n\nBut something else is whispering.\n\n\n\nA different opportunity.\n\n\n\nA new frontier.\n\n\n\nIt leaves us saying something similar that Luke Skywalker once said:\n\n\n\n**\"It’s not that I like the Empire. I hate it! But there’s nothing I can do about it right now.\"**\n\n\n\n",
    "antagonist": "\n\nThe traditional path works.\n\n\n\nIt does.\n\n\n\nIt gave us doctors, nurses, lawyers, government workers, etc.\n\nSome of the smartest, most respected people are on that path. My dad worked for the government for years, and he's very successful.\n\n\n\nEven now, there’s a new “successful” career path:\n\nBecome \"The Finance Bro.\"\n\n\n\nJoin a big firm.\n\nWork 40-60 hours a week.\n\nClimb the ladder.\n\nBuild skills.\n\nContribute to a 401(k).\n\nGet the promotion. Buy the place. Stick it out for 30 years.\n\n\n\nThat path does work.\n\n\n\nBut to me, something feels... off.\n\n\n\nLike a game is being played where the rules were before we were born.\n\nAnd no one’s forcing participation, but somehow, it feels like there's no other choice.\n\n\n\nThat’s the real antagonist:\n\nThe invisible script that says, “This is how life must go.”\n\n\n\nWake up, go to work, drink on the weekends, and pretend it's all fine.\n\nNot because it is laziness. Not because there is hate for hard work.\n\nBut because none of it fuels the flames of purpose.\n\n\n\nIt sounds like this is what freedom is—but it doesn’t feel free.\n\n\n\nIf it were, people would come and go as they pleased.\n\nThere wouldn't be this feeling of stuck.\n\nPeople wouldn’t numb themselves with drinks on Thursday, Friday, Saturday and (potential) Sunday— (\"*Sunday Funday*\")\n\n—only to wake up Monday, slightly panicked, slightly behind and trying to recover before the cycle resets again.\n\n\n\nIt's a brutal cycle.\n\n\n\nThere's a realization that someone else’s vision is being paid for, while everything and everyone else quietly fades into the background.\n\n\n\nThe tough truth is that it's on you and me to break this cycle.\n\n\n\nLife’s just reflects back our choices.\n\nAnd when it is seen, like truly seen—\n\n\n\n**It is hard to pretend that it is okay.**\n\n\n\n",
    "protagonist": "The protagonist doesn’t subscribe to this default existence.\n\n\n\nThey feel the pressure to follow the plan—but never give in.\n\n\n\nThey question it.\n\n\n\nThey are intrigued by it.\n\n\n\nThey choose something true to themselves (This might even be a doctor, lawyer, accountant, etc.).\n\n\n\nThey work—hard.\n\n\n\nMonday through Saturday, they give it everything they’ve got and empty the tank.\n\n\n\nNo shortcuts.\n\n\n\nNo excuses.\n\n\n\nNo victim mindset.\n\n\n\nThey rest and recover on Sunday—\n\nNot because they’re lazy, but because they understand *their* rhythm:\n\n\n\nStress. Rest. Stress. Rest. That’s how strength is built.\n\n\n\nThis person doesn’t care about a job title.\n\nThey care about themselves.\n\n\n\nTheir schedule might not make sense to everyone else.\n\nBut it’s built with intention.\n\n\n\nEvery block of time is a brick in the foundation of a future they believe in. (Shoutout Will Smith)\n\n\n\nThey don’t drink to forget the week.\n\n\n\nThey reflect, reset, and plan how to make the next one even better.\n\n\n\nThey aren’t afraid of work.\n\n\n\nThey aren't afraid at all, really.\n\n\n\nThat’s what makes them dangerous.\n\n\n\nAnd that’s why they always win.\n\n\n\nEven when they lose.\n\n\n\n",
    "conclusion": "So... where does one start?\n\n\n\n1. **Start a newsletter.**\n\n\n\nThere doesn't need to be a list of 10,000 subscribers. There doesn't even need to be an audience.\n\n\n\nStart with an audience of one. Think 'I'm the first reader of my newsletter'.\n\n\n\nOpen up a doc and write.\n\n\n\nUse this structure:\n\n\n\n- Set the scene (Setting)\n\n- Name the villain (Antagonist)\n\n- Introduce the hero (Protagonist)\n\n- End with action (Conclusion)\n\n\n\nIt builds clarity.\n\n\n\nIt builds consistency.\n\n\n\nOver time—it builds identity.\n\n\n\n2. **Start a YouTube channel.**\n\n\n\nNo need to even edit. There doesn't need to be a crazy setup.\n\nFrame the shot. Hit record. Speak the truth.\n\nConsistency beats aesthetics every day of the week.\n\n\n\nThere will be improvement.\n\n\n\n3. **Dopamine detox.**\n\n\n\nCut out the garbage. TikTok, endless scrolling, gaming loops, short-term highs.\n\nBuild something long-term.\n\n\n\n4. **Sleep 8–12 hours.**\n\n\n\nThis isn’t hustle culture. This is recovery culture.\n\nThis isn't being lazy-it's recharging the batteries.\n\n\n\n5. **Go to bed earlier.**\n\n\n\nMost failures happen the night before.\n\nThere doesn't need to be another hour of Netflix.\n\nWake up and be grateful for the morning.\n\n\n\nFollow routine first.\n\n\n\nBefore checking any phone. Before checking someone else’s life.\n\nOwn the schedule. Own time. That’s where real momentum is built.\n\n\n\n6. **Talk to people.**\n\n\n\nPeople offer so much inspiration if the right things are said and the right questions are asked. Say hi to your parents. Talk to friends.\n\nCompliment strangers. Being more social in the real world reminds people that they are human.\n\n\n\n7. **Eat good food.**\n\n\n\nThe gut is the second brain.\n\nEating like trash creates bad thoughts.\n\n\n\n8. **Drink a ton of water.**\n\n\n\nWater is the lifeblood.\n\nEvery time there's tired, unmotivated, or foggy feelings—it’s a good chance that there is a lack of hydration.\n\nDrink more water.\n\n\n\nSo...\n\n\n\n\"When do we start?\"\n\n\n\nLove,\n\n\n\nMatthew McMahon\n\n"
  },
  {
    "id": "bay",
    "title": "I Thought About Jumping In The Bay",
    "date": "2025-07-05",
    "excerpt": "Please be careful with this newsletter.",
    "image": "/assets/blog-photos/bay.png",
    "url": "/newsletter/post.html?id=bay",
    "setting": "Reiteration of Warning:⚠️ Please be careful with this newsletter.\n\n\n\nIt’s a tough topic. If it helps, read it with a loved one.\n\n---\n\nI thought about jumping in the bay and seeing how long I could tread water for.\n\n\n\nIt was the middle of the night and everyone else was sleeping.\n\n\n\nI’d later learn it was called an “intrusive thought.” Whatever it was called, it scared the living daylights out of me.\n\n\n\nI started to imagine what life would be like for my nieces and nephews without their Uncle Matt. I couldn’t believe I was the one having these thoughts. I didn’t even recognize myself. I was laid down on the bottom bunk bed, beneath my brother who was sound asleep.\n\n\n\nThis was supposed to be fun. This was supposed to be a relaxing vacation.\n\n\n\nUsually, I looked forward to being down the shore.\n\n\n\nInstead, I was thinking about suicide.\n\n\n\nThis wasn’t me.\n\n\n\n",
    "antagonist": "We were all down the shore. Fourteen people. One house. Packed in tight with my family.\n\n\n\nI couldn’t sleep.\n\n\n\nThis wasn’t the first time my mind had turned against me. I’d lay in bed before—thoughts racing, imagining bad scenarios. But that night, something darker, more real, crept in.\n\n\n\nWhat would happen if I jumped into the bay? How long would I be able to tread water before sinking to the bottom? Would someone save me? Would anyone even notice before it was too late?\n\n\n\nScared, heart racing, I got out of bed. I walked down the stairs and contemplated life in the kitchen.\n\n\n\nAs I peered outside, past the deck and onto the bay, I could hear my dad snoring on the couch.\n\n\n\nWhat called me to think this way?\n\n\n\nI still don’t know.\n\n\n\nI didn’t open the door.\n\n\n\nBut I wondered.\n\n\n\n**Why?**\n\n\n\nWhy am I flirting with disaster?\n\n\n\nWhy am I so close to death?\n\n\n\nInstead of walking outside, I sat down in the living room, across from my dad (still sleeping).\n\n\n\nMy mind was spiraling. Zooming.\n\n\n\nMy body stayed still.\n\n\n\n",
    "protagonist": "Then something clicked.\n\n\n\nI started having the right thoughts.\n\n\n\n“I’m not moving.”\n\n\n\n“I can think all I want, but my body’s not moving'“\n\n\n\n“There’s no way I’m doing that.” “I’m not that guy.” “I’m him.”\n\n\n\nThat’s when it all started to shift.\n\n\n\nMaybe it was my dad’s presence or something else entirely.\n\n\n\nI started praying in that chair.\n\n\n\nI started thinking about my purpose.\n\n\n\nThe visions started rushing in.\n\n\n\nA YouTube channel. A business. A mission.\n\n\n\nAll the dreams buried underneath fear, uncertainty, and doubt came rushing to the surface.\n\n\n\nI didn’t just imagine a better future—I started believing in myself in the present.\n\n\n\nMore importantly, I started being grateful.\n\n\n\nEverything that happened to me before had meaning. Every hard moment gave me something I needed. I didn’t need to stress about the future. I didn’t need to carry the weight of the past.\n\n\n\n**Everything I need is here… Right now.**\n\n\n\n",
    "conclusion": "If you’ve ever felt like I did that night, let me give you the exact things that helped pull myself out of it:\n\n\n\n1. **Protect Yourself Against Self-Harm**\n\nOne dark thought = 1,000 positive thoughts to follow. Every time I hear a voice telling me to give up, it reminds me to force a flood of positive thoughts into my head. I won the lottery just by being alive. Don’t give that up for a job you hate or a boss who doesn’t believe in you.\n\n\n\n2. **Create a Bulletproof Routine**\n\nWhat must be in your day, every day, no matter what? For me, it’s working out. Writing. Creating. If you were thinking about ending it all by doing what everyone else told you to do… then maybe it’s time to start living by your rules instead.\n\n\n\n3. **Build a Support System**\n\nTell someone. Be vulnerable. I know it’s scary. You think it might burden them. But it won’t. People will drop everything to help you. Give them the chance. What’s on the other side of fear? The life you actually want to live.\n\n\n\n4. **Eat Healthy**\n\nHealthy gut = healthy mind. When I clean up my diet and start walking around with a six-pack, it’s almost impossible to feel bad about myself. Fuel your body like your life depends on it—because it literally does.\n\n\n\n5. **Hydrate Like It’s Your Job**\n\nWater isn’t optional. It’s necessary. So many biomarkers can be improved by drinking more water. Aim for half your body weight in ounces, plus 12–24 oz per workout. Skip the extra drinks. Start with water. This is non-negotiable.\n\n\n\nThis was one of the darkest experiences of my life.\n\n\n\nBut I’m grateful for it. It’s scary to share—but maybe it saves a life.\n\n\n\nIf this message resonates with you, share it. With someone you love. Or someone who might need it.\n\n\n\nWe need to normalize these conversations.\n\n\n\nWe need to lead with vulnerability.\n\n\n\nNo more silence. No more shame.\n\n\n\nLet’s be the ones who talk about it. Let’s be the ones who save someone else’s life.\n\n\n\nI’m here for you.\n\n\n\nLove,\n\n\n\nMatthew McMahon\n\n\n\n"
  },
  {
    "id": "who",
    "title": "Who Am I",
    "date": "2025-06-27",
    "excerpt": "A little bit about me.",
    "image": "/assets/blog-photos/who.png",
    "url": "/newsletter/post.html?id=who",
    "setting": "My name’s Matthew McMahon.\n\n\n\n",
    "antagonist": "Some call me Matt.\n\n\n\nOthers say McMahon.\n\n\n\nSometimes, it’s Matty Ice.\n\n\n\nOther times it’s Matthew.\n\n\n\n",
    "protagonist": "For the purpose of this medium, let’s start with Matthew McMahon.\n\n\n\nFeel free to call me any of the above or something else entirely.\n\n\n\nJust be cool with it.\n\n\n\n",
    "conclusion": "My plan with this business is to be myself.\n\n\n\nBasically anything is fair game.\n\n\n\nSo much of the advice in the early days of online media was about “choosing a niche” or “finding the customer avatar”.\n\n\n\nThe real niche is within.\n\n\n\nThe individual is the customer avatar.\n\n\n\nThis sounds corny but be yourself.\n\n\n\nServe yourself.\n\n\n\nCreate a product for yourself.\n\n\n\nBe the audience for yourself.\n\n\n\nOnce a creator becomes a full-time producer, instead of full-time consumer, they never work another day in their life.\n\n\n\nIt’s called being self-sufficient.\n\n\n\nSelf-sustaining.\n\n\n\nIt’s all about Being.\n\n\n\nLove,\n\n\n\nMatthew McMahon\n\n\n\n"
  },
  {
    "id": "lost",
    "title": "What To Do If You're Feeling Lost",
    "date": "2023-11-25",
    "excerpt": "Have you ever felt lost?",
    "image": "/assets/blog-photos/lost.png",
    "url": "/newsletter/post.html?id=lost",
    "setting": "Have you ever felt lost?\n\n\n\nLike no idea where you're going.\n\n\n\nYou know you have to move forward. But you’re not sure which direction to go.\n\n\n\nThis one's for you.\n\n\n\n",
    "antagonist": "Imagine you’re in a race. There’s a finish line in some undisclosed location. The gun goes off...\n\n\n\nWhere do you start running?\n\n\n\nNorth? South? East? West? Maybe you need to go up or down.\n\n\n\nHow do you know which direction you're supposed to go?\n\n\n\nIf this were a 100m dash in the Olympics, it would be very clear where you needed to go.\n\n\n\nCan you imagine if you started running the wrong way? People would look at you funny. They’d start screaming “You’re going the wrong way!!!” You would seem crazy… It's common sense to run towards the finish line.\n\n\n\nBut life is a bit more complicated. You don’t always know which direction to go. The finish line isn't clear. The problem is if you don’t know where to go - you might not move.\n\n\n\nYou might be paralyzed by fear. Fear of making the wrong choice.\n\n\n\nImagine if the finish line was East.\n\n\n\nYou start heading West. You are now moving in the exact opposite direction. This might seem counterproductive. But I'd argue it's a correct choice.\n\n\n\nIf you go North or South, you might also never hit the finish line. Yet again, I'd argue it's a correct choice.\n\n\n\nLast, you might choose not to move at all. In this case, you will never hit the finish line. I'd argue this is an incorrect choice.\n\n\n\nNot moving. Not making a decision. Is moving. It is a decision. It’s the wrong decision. It’s the wrong direction.\n\n\n\n",
    "protagonist": "In the case of our Eastward located finish line… moving West, North or South is better than not moving at all. At least you are learning the territory.\n\n\n\nLet's suppose you start moving West. You go 10 miles West and decide you no longer want to move in that direction. So you go North. Another 10 miles North and you decide you no longer want to go in that direction. So you go East. 10 miles East. Stop. Now you’re moving South. Another 10 miles and you’re back where you started.\n\n\n\nBut wait!!! You’ve made no progress!!!\n\n\n\nOr did you?\n\n\n\nImagine it’s like Minecraft. In this scenario, who's map looks better?\n\n\n\n**Option A:** The Steve who traveled 40 miles in a square.\n\n\n\nOr\n\n\n\n**Option B:** The Steve who did not move at all.\n\n\n\nIf you chose Option A, then you and I are on the same page.\n\n\n\nYou see, the guy who didn't move at all was afraid of moving in the wrong direction.\n\n\n\nBut so was the guy who just walked 40 miles.\n\n\n\nYet, he overcame his fear. He embraced a potential wrong decision. This gave him more knowledge than the guy who didn’t move at all.\n\n\n\nNot to mention, what did that guy overcome to explore 40 miles of the map? He had to trek across mountains, knock out a few skeletons and build himself a temporary shelter (to keep to our Minecraft analogy).\n\n\n\nHe grew as a person during his exploration of the territory.\n\n\n\nThat's what it's about.\n\n\n\nIt's not about crossing the finish line. It's about exploring the territory and creating your map.\n\n\n\nYou want to find out what's out there. Find the place you call home.\n\n\n\nCreate your own finish line.\n\n\n\nYou might explore the entire map and decide that where you started was the finish line.\n\n\n\nYet, you wouldn't know that unless you explored in the first place.\n\n\n\nLife is moreso about crossing items off the list, rather than finding the right direction on your first try.\n\n\n\nNo matter where you go - it's going to be hard. So find the hard place that you love.\n\n\n\n\"Your blessing in life is when you find the torture you're comfortable with\" - Jerry Seinfeld.\n\n\n\n",
    "conclusion": "1. **Find Your Starting Line**\n\n\n\nYour starting line is where you are right now. Not where you were yesterday, or where you are in 10 days, or in 1 year. Where you are, Right Now.\n\n\n\nAll you have is this present moment to act. So figure out some things you would like to try. Just like you won't know where the finish line is in our imaginary race, you won't know where the finish line is in your life.\n\n\n\nYou have to start to moving in that direction, even if it's the wrong one.\n\n\n\n2. **Follow Someone Else’s Footsteps**\n\n\n\nChances are: there are people who have run a similar type of race you are hoping to run. Follow in their footsteps.\n\n\n\nWhat did they do to get to where they are? Do they have certain degrees? Do they recommend going to college? Do they have certifications?\n\n\n\nFind out exactly what they did to get to where they are and retrace their steps. Now take their steps. Feel free to avoid their pitfalls.\n\n\n\nBonus points if you manage to find and talk to them.\n\n\n\n3. **Move Slowly**\n\n\n\n\"Nature does not hurry, yet everything is accomplished.\" - Lao Tzu\n\n\n\nThere is absolutely no reason to move fast. This is not a 100m dash. Your not lining up against Usain Bolt here. You have your entire life. This isn’t a reason against moving. It’s a another way to move.\n\n\n\nYour purpose is your purpose. You will find it as long as you move.\n\n\n\nIf you move in the wrong direction, you'll feel it. Something will pull you in another direction. So go then. Follow that. Trust your heart and let it guide you.\n\n\n\n4. **Keep Track Of Your Steps**\n\n\n\nThis is equal to filling in your map. Remember our Minecraft analogy. You want the map to start filling in as you cover your spots.\n\n\n\nI recommend keeping a journal. Start to note down all the places you have been and things you have tried. What did you like? What did you not like? What did you learn? What can you teach others? What will help future runners in their journeys?\n\n\n\nWe are all trying to find our way through this race. Myself included. I am moving through this race just like you. The only reason I have an idea of where I'm going is through keeping track of where I’ve been.\n\n\n\nUnless you found the magical crystal ball that predicts the future then I hate to break it to you… The future is always uncertain.\n\n\n\nEmbrace it.\n\n\n\n5. **Enjoy The Game**\n\n\n\nThe game is not meant to be finished. It's meant to be played forever… or at least as long you can.\n\n\n\nThis is the difference between Finite Games and Infinite Games.\n\n\n\nFinite Games are played to win.\n\n\n\nInfinite Games are played to keep playing.\n\n\n\nThe best games are played forever.\n\n\n\nThe moment you think you’ve won is the moment you’ve lost. You think you’re going to be on top forever. But that feeling doesn't last. Why do you think Tom Brady kept coming back even after his 5th, 6th and 7th ring?! It's because he knows it's not about the rings. They're nice, yeah. But it’s the love of the game that matters. Tom Brady fell in love with the process. He found his torture:\n\n\n\n1. Wake up on Monday\n\n2. Study film\n\n3. Go to practice\n\n4. Game plan for Sunday\n\n5. Play on Sunday\n\n6. Hopefully win on Sunday\n\n7. Wake up on Monday\n\n8. Repeat\n\n\n\nThis will be your life if you choose this path. In my opinion, there's no other way. If you want to live a life that provides your wife and your kids with joy - choose this path.\n\n\n\nMost importantly, if you want to live a life that gives you joy, run race this way.\n\n\n\nThat’s it for this week’s edition of The McLetter.\n\n\n\nReply to this email with any questions, concerns, proclamations, etc.\n\n\n\nAs always - Let’s Get it Brother!\n\n\n\nLove,\n\n\n\nMatthew McMahon\n\n\n\n"
  },
  {
    "id": "choose",
    "title": "Choose Your Own Adventure",
    "date": "2023-11-18",
    "excerpt": "Life is like a video game",
    "image": "/assets/blog-photos/choose.png",
    "url": "/newsletter/post.html?id=choose",
    "setting": "Life is like a video game.\n\n\n\nYou're the main character.\n\n\n\nYour goal is to beat the game, enjoy the game, and learn a few things along the way.\n\n\n\nThroughout the game, there are quests that reward you when you beat them. Sometimes those quests take hours or days. But the feel of success when you complete a hard quest outweighs never attempting it in the first place.\n\n\n\nOr does it?\n\n\n\n",
    "antagonist": "Let's assume you bought the game and you have to log in. Like in life, you are born into it. You have no choice. You have to be in this game, just like you have to be in life.\n\n\n\nBut you don't have to enjoy the spoils of the game. The game offers you quests and challenges. You don't have to complete them. You could choose to chill in the main lobby for the entire game. That way you avoid losing items, death and the risk of failure.\n\n\n\nBut where's the fun in that?\n\n\n\nThe game is fun because of the danger.\n\n\n\nThe risk of your character's death is exciting.\n\n\n\nIf you want that feeling of success from completing a hard puzzle, you must fail your way through it. Otherwise, you never do anything.\n\n\n\nYour character remains unchanged. You watch as other characters return to the main lobby. Decked out in new armor. Looking to pursue the next mission that's even more fun and exciting.\n\n\n\nIf you don't exit the lobby and complete your quests, you never level up. You never get to pursue the next level of excitement. Let alone, enjoy the excitement of the next challenge in front of you. Other players won't respect your level. And you will start to question what it is that you are doing wrong.\n\n\n\n\"Other players are having fun, why can't I have fun?\" \"What am I'm doing wrong?\"\n\n\n\n",
    "protagonist": "One of my favorite games growing up was The Legend of Zelda: The Wind Waker.\n\n\n\nThe goal of the game was simple:\n\n\n\nbeat the final boss (Ganon), rescue the princess (Zelda) and save the world (The Great Sea).\n\n\n\nTo do so, there were dungeons and quests you had to battle through. Dungeons required you to solve a series of puzzles which led to a room where you fought a boss. Quests required you to sail across the ocean to get requested items for NPC's.\n\n\n\nThe more dungeons and quests you completed, the better your character (Link) got.\n\n\n\nIt was simple - beat all the dungeons and take on all the quests.\n\n\n\nIf you did this, you increased your odds of beating the game.\n\n\n\nThe only problem was:\n\n\n\nThe boss of each dungeon was super scary and lots of monsters filled the ocean.\n\n\n\nThese factors alone deserted me on the starting island. I didn't want to leave because I feared that my character might die.\n\n\n\nI rationalized that it wasn't so bad.\n\n\n\nThen I watched my older brother play.\n\n\n\nHe braved his way through every dungeon and quest. His character grew stronger. The items he got were cooler. The bosses he fought were bigger.\n\n\n\nI realized the game got way more fun the further away you got from the starting island.\n\n\n\nI knew if I wanted to get where he was, I had to brave my way through each challenge, one at a time. I had to overcome my fear of sailing across the The Great Sea. I had to overcome my fear of challenging the boss and dying.\n\n\n\nIt wasn't easy, but it was rewarding. It made the game more fun to play. It also made it more terrifying. In the end, I was proud when I finally beat the game. Moreso, I enjoyed the experience of playing such a well designed game. To this day, it's one of my favorite games of all time.\n\n\n\nHow does this relate to your life?\n\n\n\nIn your life, you are the main character. You are Link.\n\n\n\nIt's your turn to enter dungeons and take on quests.\n\n\n\nThese obstacles are in your way for a reason. If you want to beat the boss (a problem in the way of your success) you have to overcome your problems. If you want cooler items (i.e., money) you have to solve other people's problems.\n\n\n\nIf you do these things, your character will get better, the game will be more fun and you might learn a thing or two.\n\n\n\n",
    "conclusion": "So where do you start? Here's a list of things you can do to start treating your life like the video game it is... and start playing to win:\n\n\n\n1. **Acquire your map.** It's a little easier to do in a video game. The game usually gives you a map that tells you where to go. Your map is your journal. Write down everything about your circumstance. Map out your game. What are your goals? What are the tasks you need to do to complete your goals? Use this journal to map out what your life looks like right now and where you need to go.\n\n\n\n**Bonus:** What do you want your game not to look like? Where are the areas on your map that you want your character to avoid?\n\n\n\n2. **Explore the territory.** When a video game gives you a map, a large part of it is blurry. You have to explore the map. Seek out the blurry spots. If you're struggling with this step it's because you don't know what you want. Research your curiosities. Find players who have what you want and listen to them. Ask them what you have to do to get to where they are. They will give you a list of things that will make your map more clear.\n\n\n\n3. **Complete Quests.** As your map becomes more clear, quests (challenges in your life) will start to pop up. Embrace those challenges. This is the hard part. You know what you have to do, you just have to do it. In a video game, it can take hours or days to complete a quest. In the real world, it can take days, weeks, months or years. If you want to be a lawyer, you have to go to law school for 2-3 years. If you want to create content for a living, you need to create content for years. It's simple… not easy.\n\n\n\n4. **Fight Mobs. Drink Healing Potions. Set Your Spawn Point.** Fighting Mobs is equal to Working Out. Drinking Healing Potions is equal to Eating Healthy. Setting Your Spawn Point is equal to Sleeping. It's important to have these 3 things in check because it gives your character the best chance of beating a level. Fighting Mobs gives your character better skills. Exercising does the same thing. If you want to be stronger, lift weights. If you want to be faster, do speed drills. If you want to jump higher, do jumping drills. Name a physical attribute you want to improve and exercise will do that. Drinking Healing Potions restores your hearts. Dieting does the same thing. Eat lots of protein and a healthy combination of fats and carbs. This will heal your body and mind as challenges extract their toll on your character. Eat your body weight in protein. Fill the rest of your calories in with carbs and fats. This will give you the ability to recover stronger than you were before. Setting your spawn point allows your character to restore energy. Sleeping does the same thing. If you do not sleep, you will not have the energy required to complete the challenges on the map. 7-8 hours of sleep each night will give your character the energy required to complete the tasks on your map. Also, it will keep you clear and focused.\n\n\n\nHope you enjoyed this edition of The McLetter. Reply to this email with any questions, concerns, proclamations, etc.\n\n\n\nLet’s Get it Brother!\n\n\n\nLove,\n\n\n\nMatthew McMahon\n\n"
  },
  {
    "id": "reversing",
    "title": "Reversing Your Potential As A Man",
    "date": "2023-11-11",
    "excerpt": "Masculine traits like accountability, ownership and purpose have gone down the tube in today’s modern society.",
    "image": "/assets/blog-photos/reversing.png",
    "url": "/newsletter/post.html?id=reversing",
    "setting": "Masculine traits like accountability, ownership and purpose have gone down the tube in today’s modern society.\n\n\n\nThere’s a famous quote that illustrates this well:\n\n\n\n“Hard times create strong men, strong men create good times, good times create weak men, and weak men create hard times”\n\n\n\nIn times of abundance, strong men are the first to go. We live in times where food, water and comfort are well taken care of. Yet more than ever, men are lacking purpose, direction and joy. This is leading to the total breakdown of our society. If we don't act fast, we will continue to follow the cycle of man and find our entire society drowning in hard times.\n\n\n\n",
    "antagonist": "But maybe this is wrong. Maybe we don’t need men anymore.\n\n\n\nOf course, we needed strong men in the past when we had to defend against lions, tigers and other threats to our tribe. But we're not facing those threats anymore. So why do we even need masculinity? Maybe it's possible that the whole world should be feminine. Women should be feminine and men should be feminine.\n\n\n\nThe problem with this is that we are still hardwired to act in ways that made us joyful. In the same ways are ancestors had an instinct to protect and provide, so too do you. Do you not hear your inner voice telling you something is wrong?\n\n\n\nWhen you're not getting up early, going to the gym and building your life's work, you feel unhappy, angry and upset. It leads to lack of identity, lack of purpose and eventually, mental illness.\n\n\n\nAs a man, you have desires. You want the nice car, the nice house, the beautiful wife, etc. But, above all else, you want freedom. The freedom to pursue what you want, when you want. The freedom to provide for your tribe and protect those you care about. It’s your mission. Your reason for being on this earth.\n\n\n\nWhen your desire doesn’t pull you towards this purpose. You know something’s wrong. Every time you miss a workout, don't work on your hustle and drink alcohol instead of working on your purpose, your inner voice makes you pay. Do this long enough and you’re at total odds with yourself. The last thing you want is to be on your death bed, filled with regret about what you could’ve or should’ve done.\n\n\n\nThe goal is to be on your death bed, with your children and your children's children surrounding you. You want to remember all the wonderful moments spent with them and gifts you provided to the world.\n\n\n\nYou will reflect on the things you built and the time you spent. You'll wonder, “Did I spend my time the way I wanted to spend it?”\n\n\n\nIf you as a man don't embrace baseline masculine qualities like ownership, authenticity and purpose, you will live a life of regret. It will become more and more painful the longer you travel down this road.\n\n\n\n",
    "protagonist": "Fortunately, you are never to late to start. You can start right now, in this moment. Part of being a man is being present. As Tony Soprano said, \"‘remember when’ is the lowest form of conversation\".\n\n\n\nAs a man you always need to be present, looking forward. What can you use at your disposal now, to get to where you want to be. Use that information to take action.\n\n\n\nWhen you take action, you may fail. But you will be building skills in the process. You will be gaining XP for core masculine traits. Traits like embracing uncomfortability, discipline, presence, strength, etc. will start to level up. The real path to joy comes from the day in, day out grind towards your purpose as a man.\n\n\n\nIn order to pursue your purpose as a man, you need to level up your masculine traits. You have to put in the hard work everyday. You have to suffer.\n\n\n\nAnd you have to be smart about it. Sacrifice things that feel good in the moment for things that will bring results in the future. It feels good to munch on a piece of banana bread first thing in the morning when you wake up. But waiting until 12pm, doing fasted cardio and then having that treat is more rewarding and brings you more joy.\n\n\n\nAnything I've ever done in my life that's been rewarding, has been hard. As I write this, I have a solid physique, one that I am proud of. But it took years of going to the gym, eating a lot of protein and missing out on parties. All of these were sacrifices. I sacrificed those moments of temporary happiness in the past, for the joy of having the physical presence I wanted today. And this sacrifice will continue so I can enjoy it long into the future.\n\n\n\nRecognize that if you want to obtain your dream (physique, career, wife, etc.) you will need to make sacrifices in the now. It’s a conscious decision you need to make right now. If you want to wake up early tomorrow morning, you need to make that decision now. If this sounds like something you want, then here are some actionable steps on what that might look like for you.\n\n\n\n",
    "conclusion": "After years of exploring the best ways to maximize your energy for future success on achieving your goals, here is my current process:\n\n\n\n1. **Identify Your Purpose.** You need to figure out why you are here on this earth. What is your purpose for being here? If in this moment, you don’t know, then your purpose is finding that out. This might take a while and that’s ok. I am still in a process of self discovery. It’s hard, I know it’s hard, so I enjoy the ups and downs of it because that’s the point. Talk to people you find interesting. Look at your watch history on YouTube. Are you watching videos about the gym, diet, basketball, football, etc.? If so write that down. If you don’t know what your purpose is, write down a list of 25 things that you want to try and cross them off the list, one at a time. Which of those 25 things felt natural to you? If you enjoyed none of them, then write down another 25 things and try them. Continue this process and you will move closer towards your purpose.\n\n\n\n2. **Write down your goals.** A goal is something you are moving towards. In Football (the American version) the goal post signals the place that the offense wants to be. Write down where you want to be. What do you want to accomplish? If the gym is the thing you want to pursue, write down what you want. Be extremely specific. Do you want to look a certain way? Is there a certain physique you want to have? Do you want to look more like Arnold from The Terminator or Brad Pitt from Fight Club? Find someone who has the physique you want, print out that picture and tape it to the mirror in your bathroom. Get extremely clear on what your dream life looks like in the next 5 years.\n\n\n\n3. **Break down your goals into daily habits.** Figure out what you have to do on a daily basis in order to get what you want. Maybe you don’t know and you have to seek out that information. Figure out the workouts and habits of the people that have what you want. Build you daily routine that will create the progress towards your goal. For example, to achieve your dream physique, your Monday might look like waking up a little earlier, going to the gym, doing 15 sets of chest and eating 180 grams of protein. If you consistently cross out the items on your list, every day, then your goals will become reality.\n\n\n\n4. **Do the work, fight through the obstacles.** Now the hard part. The first 3 parts are sexy. It feels good to write down your goals. It feels good to daydream about what your life will look like or feel like when you’ve achieved your dreams. It doesn’t feel good when your alarm clock goes off at 6:30am and you have to embrace the suck of getting out of bed in order to make the vision on your whiteboard a reality. But this is life. This is what you must accept to level up your character and live a life of joy. The joy comes from doing what you say you’re going to do on a daily basis.\n\n\n\n5. **Make Sacrifices.** Making sacrifices will give you back extra energy that allows you to fight through obstacles. Dopamine is the reward chemical. When you experience that “feel good” energy, that’s dopamine releasing in your brain. Our ancestors received dopamine when they did something successful, like kill a buffalo, which took hours of hard work. Today, you can get cheap dopamine with things like soda, alcohol, video games, nicotine, etc. with no hard work at all. The problem is, dopamine is finite but renewable. It renews itself (through things like rest, walks and yoga), but you only have so much of it per day, week, month, etc. So, if you do easy things you exhaust your supply of dopamine, it harder to get out of bed when the alarm goes off at 6:30am. The more sacrifices of easy dopamine you are able to make, the easier it becomes to do hard things, like daily tasks, that create actual progress towards your goals.\n\n\n\n6. **Dream Big.** What you think is possible, is far outside your imagination. Your first goal might be to build your dream physique. Then you build it and your like, “what’s next?\" Why not help your best friend build their dream physique? Maybe you decide you want all your friends to build their dream physique. Now you have a community of guys leveling up and pursuing their purpose.\n\n\n\nThis is how society becomes strong once again. This is how we reverse the cycle of man and create prosperous times.\n\n\n\nLove,\n\n\n\nMatthew McMahon\n\n\n\n"
  },
  {
    "id": "frustration",
    "title": "The Frustration of Frustration",
    "date": "2023-11-04",
    "excerpt": "The road to where you want to be and where you are now may be paved with frustration.",
    "image": "/assets/blog-photos/frustration.png",
    "url": "/newsletter/post.html?id=frustration",
    "setting": "The road to where you want to be and where you are now is paved with frustration.\n\n\n\nIf you care about something and want to succeed, you know the frustration that comes when things don't go your way.\n\n\n\nMaybe you're not getting enough playing time. Maybe the coach gave you a chance but you messed up big. You thought to yourself: \"So stupid! How could I miss that shot! I was wide open!\"\n\n\n\nSometimes the frustration will be so great, the thought of quitting will enter your mind.\n\n\n\nA frustrated practice session can lead to you chucking the sport object (For me, a basketball) into the darkest, deepest corner of your closet in hopes of never seeing it again (only to pick it up and practice again tomorrow).\n\n\n\nFrustration is a hard thing to deal with.\n\n\n\nMoreover, It's a hard thing to cope with.\n\n\n\nPeople see that you are frustrated and they tell you not to be.\n\n\n\nThey tell you: “it's ok” or “don’t worry about it”.\n\n\n\nBut when you try to explain to them your frustration, people don't understand. They can't empathize with why you care so much or why you can't just let it roll off your back.\n\n\n\nMaybe you even think to yourself, \"why am I so hard on myself.\"\n\n\n\nYou know that if this were one of your friends you would tell them not to be so hard on themselves.\n\n\n\nSo why are you so hard on ourselves?\n\n\n\nWhy is it that when things don't go your way, you get so frustrated?\n\n\n\n",
    "antagonist": "One thing that frustration leads us to do (unfortunately) is quit.\n\n\n\nThis type of quitting may be a physical action (walking out of the gym, coming off the field, turning off your Xbox, etc.) but it occurs because of what’s happening in our mental.\n\n\n\nWhen you decide to physically leave the gym after a frustrating workout, it's because you already made the mental choice to do so.\n\n\n\nThe physical decision flows afterwards.\n\n\n\nAs a former college basketball player, my early career was plagued by moments where frustration got the best of me.\n\n\n\nThere were times when I would be playing bad, the ref would be making bad calls and the coach would be yelling at me.\n\n\n\nAlthough it was still early in the game, my mental switch would shut off and I would start to make even more physical errors (turn the ball over, miss wide open shots and eventually request to come out of the game).\n\n\n\nYou know frustration is not an enjoyable experience.\n\n\n\nIt's makes your head feel hot, and the world feels like it's caving in on you.\n\n\n\nSometimes, you think the best thing to do when frustration hits is quit.\n\n\n\nThe easiest way to handle frustration, is to take yourself out of the environment causing the frustration entirely (i.e., walk out of the gym).\n\n\n\nBut choosing the easy route does not allow us to unlock deeper levels of concentration and focus.\n\n\n\nOne of the first steps in obtaining a flow state experience is by embracing the process of struggle.\n\n\n\nIf you mentally quit every time the going gets tough, then you make the easy decision and deny yourself the opportunity to reach a deeper, more immersive experience in your chosen passion.\n\n\n\n",
    "protagonist": "Later on in my basketball player, I would schedule hour long workouts for myself throughout the week.\n\n\n\nThese hour long workouts were meant to be slightly out of my comfort zone and were focused on making shots.\n\n\n\nIf I did not make shots, I would not go to the next drill.\n\n\n\nSo even though the workouts were supposed to be an hour long, they would sometimes go 30 minutes (I was cash money) and other times go 90 minutes (I was shooting bricks).\n\n\n\nBut, I always made the promise to myself that I would finish the workout no matter how frustrated I would get.\n\n\n\nBecause I didn't have the option of quitting, I had to dial in.\n\n\n\nI had to figure out how to increase my concentration and focus.\n\n\n\nSometimes this meant I had to slow down my workouts and go through the mechanics.\n\n\n\nThis would narrow my focus on the fundamentals of my form and understand my craft on a deeper level.\n\n\n\nBy simply not giving myself a way out of a workout, my brain had to get creative in order to make shots and finish it.\n\n\n\nIt had to struggle and figure out ways to play well and I would use frustration as a signal to do so.\n\n\n\nThis is the hard path, but it's the rewarding path.\n\n\n\nWhen you choose the path of embracing frustration, you condition your brain to embrace these painful moments.\n\n\n\nBy design, your brain is made to seek pleasure. When the workout is done, and your subconscious is analyzing these workouts it will seek to remove those moments of pain from your next workout.\n\n\n\nHow can it remove those moments of pain if you make that commitment to finishing through?\n\n\n\nBy making you better and more adapted to handle that activity.\n\n\n\nAKA skills go up.\n\n\n\n",
    "conclusion": "So how can you can take action on embracing frustration?\n\n\n\n1. **Make a mental commitment to finish whatever you are doing to the fullest.** If you're best that day is just showing up and being in the gym for an hour, do that. Don't leave a second earlier.\n\n\n\n2. **Learn to become conscious of your frustration and use it as a signal to embrace it.** Most of life is becoming conscious of your mistakes and creating gameplans around them. Simply by recognizing your frustration, you are realizing that it is an issue. The path to embracing frustration will require you to take on pain in the short-run, in order to live a life of joy in the long-run. This requires your brain to know what it's sacrificing. It must consciously know that the pain of embracing frustration in those moments, is for the joy of living on the other side of it in the future. And oh boy is there joy in doing so!\n\n\n\n3. **Breath through frustration and relax.** The best way to handle frustration, after recognizing it, is by breathing. The natural breathing frequency (aka resonance frequency) is a 4 second inhale and 6 second exhale. Your goal is always to be as immersed in an activity as possible. Your goal is to enter flow. Frustration (or struggle as Steven Kotler refers to it in his book The Art of Impossible) is the first stage in what he calls “The Flow Cycle”. Thus, acknowledge your frustration and breathe through it.\n\n\n\n4. **Help someone else out with their frustration.** This may not apply if you're practicing by yourself, but if you're in a game environment, team practice or partner workout, you can apply this strategy. If you are frustrated and you see someone else is frustrated, relieve them of their frustration by encouraging them and pushing them to keep going. The action of telling someone this will make you want to be consistent with your words and thus, your actions will follow suit.\n\n\n\nThat's all for this one. Appreciate you reading through and I hope you received some value from this. Feel free to let me know what you liked and didn’t like from this week’s edition.\n\n\n\nLove,\n\n\n\nMatthew McMahon\n\n\n\n"
  }
]